; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	Star7 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation4 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star6)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star6)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite2 Star7)
	(pointing satellite3 GroundStation4)
	(pointing satellite4 Planet13)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Planet12 spectrograph1)
	(have_image Planet13 spectrograph0)
	(have_image Planet14 spectrograph1)
	(have_image Star15 thermograph2)
	(have_image Phenomenon16 thermograph2)
))

)

; plan
1. (turn_to satellite1 star2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star2)
   goals met: 0 of 13
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite1 planet13 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet13)
   goals met: 0 of 13
5. (take_image satellite1 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 1 of 13
6. (turn_to satellite1 planet12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet12)
   goals met: 1 of 13
7. (take_image satellite1 planet12 instrument1 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 2 of 13
8. (turn_to satellite1 planet10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet10)
   goals met: 2 of 13
9. (take_image satellite1 planet10 instrument1 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 13
10. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 13
11. (take_image satellite1 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 13
12. (turn_to satellite1 phenomenon16 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 13
13. (take_image satellite1 phenomenon16 instrument1 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 5 of 13
14. (turn_to satellite1 planet14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet14)
   goals met: 5 of 13
15. (take_image satellite1 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 13
16. (turn_to satellite1 star11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star11)
   goals met: 6 of 13
17. (take_image satellite1 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 7 of 13
18. (turn_to satellite1 star15 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star15)
   goals met: 7 of 13
19. (take_image satellite1 star15 instrument1 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 8 of 13
20. (turn_to satellite1 star8 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star8)
   goals met: 8 of 13
21. (take_image satellite1 star8 instrument1 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 9 of 13
22. (turn_to satellite1 groundstation3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation3)
   goals met: 10 of 13
23. (turn_to satellite2 star7 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star7)
   goals met: 11 of 13
24. (turn_to satellite3 groundstation4 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation4)
   goals met: 12 of 13
25. (turn_to satellite4 planet13 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 planet13)
   goals met: 13 of 13
